---
layout: post
category: life
title: 回顾最近的学习方法
---

回顾一下最近一段时间的学习方法。 按天登入一组笔记，每个笔记的格式如下

```
---
* uuid: 9fd615ab-85a5-4ccb-92cf-31cc0c70a3a5
* tags: tag_a|tag_b
* url: <https://example.org>

This is content.
```

它使用的基本假设是：

- 松散知识点在长时间跨度下聚合可得领域知识图谱
- 少量知识点的摄入带来更少的心智负担

相应地，我要付出一些额外的精力：

- 习惯养成，依赖惯性完成量的累积
- 需要花一些时间处理任务管理

但我相信，这额外付出的两个对我来说是可以接受的。

- 习惯养成总体而言是一件好事，尽管很困难，但我的毅力会是一个优势
- 上下文切换和任务管理对于程序员来说是家常便饭

一些其它想法：

- 这套方法可以容纳多个领域的知识点异步但稳定的摄入，想要尝试套用到语言学习上。
- 可用标签和搜索做子领域的聚合，但总而来看还是不够满意，需要想办法提升使用体验。
- 还缺少一个稳定的流程，将知识内化，进而创造出新东西。目前来看，仅仅做到了知识的持续摄入而已。
- 需要和习惯养成或Todo类应用配合使用，做好目标管理。例如技术类阅读一周五天的进度管理。

EOF
